//=============================================================================
//
// ゲームオーバーの処理[end.h]
// Author：tanaka rikiya
//
//=============================================================================
#ifndef _END_H_
#define _END_H_

#define _CRT_SECURE_NO_WARNINGS

//インクルードファイル
#include "main.h"
//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitEnd(void);
void UninitEnd(void);
void UpdateEnd(void);
void DrawEnd(void);

#endif