//=============================================================================
//
// メッシュフィールド処理 [meshField.h]
// Author : Tanaka Rikiya
//
//=============================================================================
#ifndef _MESHFIELD_H_
#define _MESHFIELD_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitMeshField(void);
void UninitMeshField(void);
void UpdateMeshField(void);
void DrawMeshField(void);
void MakeEffect_Field(void);

#endif
