//=============================================================================
//
// 波（上）処理 [MeshTenjoUp.h]
// Author : Tanaka Rikiya
//
//=============================================================================
#ifndef _MESHTENJOUP_H_
#define _MESHTENJOUP_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitMeshTenjoUp(void);
void UninitMeshTenjoUp(void);
void UpdateMeshTenjoUp(void);
void DrawMeshTenjoUp(void);


#endif
